# GetConditionLowerValue Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationServiceButton..::..GetConditionLowerValue Method
FabricationServiceButton Class See Also
---
Gets the condition lower value (valid if greater or equal) for a given condition index.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public double GetConditionLowerValue(
	int condition
)
```

Visual Basic
---
```text
Public Function GetConditionLowerValue ( _
	condition As Integer _
) As Double
```

Visual C++
---
```text
public:
double GetConditionLowerValue(
	int condition
)
```

# ### Parameters
condition
    Type: System..::..Int32 The condition index.
# ### Return Value
The condition lower value.
# Remarks
A value of -1 indicates an unrestricted value.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | The index condition is not larger or equal to 0 and less than ConditionCount. |

# See Also
FabricationServiceButton Class
Autodesk.Revit.DB Namespace